---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.MaxWidthAndHeightReached
source: html/8e718c6b-7d65-568b-1788-9c6868a5b8dc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.MaxWidthAndHeightReached Property

Maximum width and height reached during sizing

## Syntax (C#)
```csharp
public static FailureDefinitionId MaxWidthAndHeightReached { get; }
```